app/controllers/admin/clubs_controller.rb

SELECT * FROM `clubs`
---
  def index
    @clubs = Club.all

SELECT * FROM `clubs` WHERE (`clubs`.`id` = 1)
---
  def show
    @club = Club.find(params[:id])

SELECT * FROM `clubs` WHERE (`clubs`.`id` = 1)
---
  def edit
    @club = Club.find(params[:id])

SELECT * FROM `clubs` WHERE (`clubs`.`id` = 1)
UPDATE `clubs` SET `updated_at` = '2010-10-19 17:38:03', `copyright` = 'Copyright © 2010, Peninsula Velo Cycling CLub. All\r\nrights reserved.', `description` = '<p>\r\n		 Peninsula Velo is a unique mix of racers and recreational riders. Racers\r\nparticipate on the road, track and trails. Club members travel to century rides\r\nthroughout California. PV gives back to the bicycling community by hosting two\r\nof the most popular, longest running races in the area: the San Bruno Hill Climb\r\nand the Burlingame Criterium. PV also gives back to the community where we live\r\nand ride.\r\n	 </p>', `mission` = '<p>\r\n		 Support club membership through fun racing and recreational riding\r\nactivities to improve performance.\r\n	 </p>' WHERE `id` = 1
---
  def update
    @club = Club.find(params[:id])

    respond_to do |format|
      if @club.update_attributes(params[:club])

SELECT * FROM `clubs`
---
  def load_clubs
    @clubs = Club.all