app/controllers/admin/content_types_controller.rb

  def index
    @content_types = ContentType.all
---
SELECT * FROM `content_types`

  def show
    @content_type = ContentType.find(params[:id])
---
SELECT * FROM `content_types` WHERE (`content_types`.`id` = 1)

  def edit
    @content_type = ContentType.find(params[:id])
---
SELECT * FROM `content_types` WHERE (`content_types`.`id` = 1)

  def create
    @content_type = ContentType.new(params[:content_type])

    respond_to do |format|
      if @content_type.save
---
INSERT INTO `content_types` (`name`, `created_at`, `updated_at`) VALUES('test content type', '2010-10-23 23:31:28', '2010-10-23 23:31:28')

  def update
    @content_type = ContentType.find(params[:id])
---
SELECT * FROM `content_types` WHERE (`content_types`.`id` = 1)

  def destroy
    @content_type = ContentType.find(params[:id])
    @content_type.destroy
---
SELECT * FROM `content_types` WHERE (`content_types`.`id` = 5)
DELETE FROM `content_types` WHERE `id` = 5

  def load_content_types
    @content_types = ContentType.all
---
SELECT * FROM `content_types`