app/controllers/admin/contacts_controller.rb

SELECT * FROM `contacts`
---
  def index
    @contacts = Contact.all

SELECT * FROM `contacts` WHERE (`contacts`.`id` = 1)
---
  def show
    @contact = Contact.find(params[:id])

INSERT INTO `contacts` (`city`, `zip`, `secondary_phone`, `created_at`, `country`, `updated_at`, `street`, `im_handle`, `user_id`, `im_type_id`, `state`, `primary_phone`, `email`) VALUES('San Francisco', '94111', '650-555-1313', '2010-10-22 23:04:25', 'United States', '2010-10-22 23:04:25', '1 Main St', 'jd', NULL, 0, 'California', '650-555-1212', 'jd@penvelo.org')
---
  def create
    @contact = Contact.new(params[:contact])

    respond_to do |format|
      if @contact.save

SELECT * FROM `contacts` WHERE (`contacts`.`id` = 1)
---
  def edit
    @contact = Contact.find(params[:id])

SELECT * FROM `contacts` WHERE (`contacts`.`id` = 1)
UPDATE `contacts` SET `updated_at` = '2010-10-22 23:07:00', `im_type_id` = NULL, `im_handle` = 'jdb' WHERE `id` = 1
---
  def update
    @contact = Contact.find(params[:id])
    #raise @contact.inspect
    respond_to do |format|
      if @contact.update_attributes(params[:contact])

SELECT * FROM `contacts`
---
  def load_contacts
    @contacts = Contact.all