app/controllers/admin/feedback_types_controller.rb

  def index
    @feedback_types = FeedbackType.all
---
SELECT * FROM `feedback_types`

  def show
    @feedback_type = FeedbackType.find(params[:id])
---
SELECT * FROM `feedback_types` WHERE (`feedback_types`.`id` = 1)

  def edit
    @feedback_type = FeedbackType.find(params[:id])
---
SELECT * FROM `feedback_types` WHERE (`feedback_types`.`id` = 5)

  def create
    @feedback_type = FeedbackType.new(params[:feedback_type])

    respond_to do |format|
      if @feedback_type.save
---
INSERT INTO `feedback_types` (`name`, `created_at`, `updated_at`) VALUES('blah', '2010-10-24 00:06:02', '2010-10-24 00:06:02')

  def update
    @feedback_type = FeedbackType.find(params[:id])

    respond_to do |format|
      if @feedback_type.update_attributes(params[:feedback_type])
---
SELECT * FROM `feedback_types` WHERE (`feedback_types`.`id` = 5)
UPDATE `feedback_types` SET `updated_at` = '2010-10-24 00:06:12', `name` = 'blah blah' WHERE `id` = 5

  def destroy
    @feedback_type = FeedbackType.find(params[:id])
    @feedback_type.destroy
---
SELECT * FROM `feedback_types` WHERE (`feedback_types`.`id` = 5)
DELETE FROM `feedback_types` WHERE `id` = 5

  def load_feedback_types
    @feedback_types = FeedbackType.all
---
SELECT * FROM `feedback_types`