app/controllers/admin/im_types_controller.rb

  def index
    @im_types = ImType.all
---
SELECT * FROM `im_types`

  def show
    @im_type = ImType.find(params[:id])
---
SELECT * FROM `im_types` WHERE (`im_types`.`id` = 0)

  def edit
    @im_type = ImType.find(params[:id])
---
SELECT * FROM `im_types` WHERE (`im_types`.`id` = 1)

  def create
    @im_type = ImType.new(params[:im_type])

    respond_to do |format|
      if @im_type.save
---
INSERT INTO `im_types` (`name`, `created_at`, `updated_at`) VALUES('yahoo! messenger', '2010-10-23 23:11:20', '2010-10-23 23:11:20')

  def update
    @im_type = ImType.find(params[:id])

    respond_to do |format|
      if @im_type.update_attributes(params[:im_type])
---
SELECT * FROM `im_types` WHERE (`im_types`.`id` = 5)
UPDATE `im_types` SET `updated_at` = '2010-10-23 23:13:05', `name` = 'Yahoo! messenger' WHERE `id` = 5

  def destroy
    @im_type = ImType.find(params[:id])
    @im_type.destroy
---
SELECT * FROM `im_types` WHERE (`im_types`.`id` = 4)
DELETE FROM `im_types` WHERE `id` = 4

  def load_im_types
    @im_types = ImType.all
---
SELECT * FROM `im_types`