app/controllers/admin/positions_controller.rb

SELECT * FROM `positions`
---
  def index
    @positions = Position.all

SELECT * FROM `positions` WHERE (`positions`.`id` = 17)
---
  def show
    @position = Position.find(params[:id])

SELECT * FROM `positions` WHERE (`positions`.`id` = 17)
---
  def edit
    @position = Position.find(params[:id])

INSERT INTO `positions` (`name`, `created_at`, `updated_at`) VALUES('asshole', '2010-10-24 00:42:03', '2010-10-24 00:42:03')
---
  def create
    @position = Position.new(params[:position])

    respond_to do |format|
      if @position.save

SELECT * FROM `positions` WHERE (`positions`.`id` = 17)
UPDATE `positions` SET `updated_at` = '2010-10-24 00:42:30', `name` = 'asshole & pussy lover' WHERE `id` = 17
---
  def update
    @position = Position.find(params[:id])

    respond_to do |format|
      if @position.update_attributes(params[:position])

SELECT * FROM `positions` WHERE (`positions`.`id` = 17)
DELETE FROM `positions` WHERE `id` = 17
---
  def destroy
    @position = Position.find(params[:id])
    @position.destroy

SELECT * FROM `positions`
---
  def load_positions
    @positions = Position.all