app/controllers/admin/ride_types_controller.rb

  def index
    @ride_types = RideType.all
---
SELECT * FROM `ride_types`

  def show
    @ride_type = RideType.find(params[:id])
---
SELECT * FROM `ride_types` WHERE (`ride_types`.`id` = 1)

  def edit
    @ride_type = RideType.find(params[:id])
---
SELECT * FROM `ride_types` WHERE (`ride_types`.`id` = 2)

  def create
    @ride_type = RideType.new(params[:ride_type])

    respond_to do |format|
      if @ride_type.save
---
INSERT INTO `ride_types` (`name`, `created_at`, `updated_at`) VALUES('test ride type', '2010-10-23 23:56:36', '2010-10-23 23:56:36')

  def update
    @ride_type = RideType.find(params[:id])
---
SELECT * FROM `ride_types` WHERE (`ride_types`.`id` = 2)

  def destroy
    @ride_type = RideType.find(params[:id])
    @ride_type.destroy
---
SELECT * FROM `ride_types` WHERE (`ride_types`.`id` = 5)
DELETE FROM `ride_types` WHERE `id` = 5

  def load_ride_types
    @ride_types = RideType.all
---
SELECT * FROM `ride_types`