app/controllers/admin/roles_controller.rb

  def index
    @roles = Role.all
---
SELECT * FROM `roles`

  def show
    @role = Role.find(params[:id])
---
SELECT * FROM `roles` WHERE (`roles`.`id` = 8)

  def edit
    @role = Role.find(params[:id])
---
SELECT * FROM `roles` WHERE (`roles`.`id` = 8)

  def create
    @role = Role.new(params[:role])

    respond_to do |format|
      if @role.save
---
INSERT INTO `roles` (`name`, `created_at`, `authorizable_type`, `updated_at`, `authorizable_id`) VALUES('dork', '2010-10-24 00:32:50', NULL, '2010-10-24 00:32:50', NULL)

  def update
    @role = Role.find(params[:id])

    respond_to do |format|
      if @role.update_attributes(params[:role])
---
SELECT * FROM `roles` WHERE (`roles`.`id` = 8)
UPDATE `roles` SET `updated_at` = '2010-10-24 00:33:12', `name` = 'double dork' WHERE `id` = 8

  def destroy
    @role = Role.find(params[:id])
    @role.destroy
---
SELECT * FROM `roles` WHERE (`roles`.`id` = 8)
DELETE FROM `roles` WHERE `id` = 8

  def load_roles
    @roles = Role.all
---
SELECT * FROM `roles`