app/controllers/admin/sponsor_types_controller.rb

SELECT * FROM `sponsor_types`
---
  def index
    @sponsor_types = SponsorType.all

SELECT * FROM `sponsor_types` WHERE (`sponsor_types`.`id` = 1)
---
  def show
    @sponsor_type = SponsorType.find(params[:id])

SELECT * FROM `sponsor_types` WHERE (`sponsor_types`.`id` = 1)
---
  def edit
    @sponsor_type = SponsorType.find(params[:id])

SELECT * FROM `sponsor_types`
---
  def load_sponsor_types
    @sponsor_types = SponsorType.all