app/controllers/admin/users_controller.rb

INSERT INTO `users` (`single_access_token`, `last_request_at`, `created_at`, `profile`, `crypted_password`, `user_image_url`, `perishable_token`, `updated_at`, `performance_team_member`, `usac_license`, `gender`, `failed_login_count`, `current_login_ip`, `password_salt`, `current_login_at`, `last_name`, `persistence_token`, `login_count`, `middle_initial`, `date_of_birth`, `last_login_ip`, `login`, `last_login_at`, `first_name`, `image_gallery_url`, `member_since`, `active`) VALUES('s85IAl51CS5jFt9SZZ6Y', NULL, '2010-10-22 21:07:10', '... jane\'s profile ...', 'bd4eb5afeda22d78628a4e6944576607c840b630987653e25d64524a99af5343cecc91ab6587d9717fe13a7c990aa5a3de89cadd64723ac5afcbfe232bbff87a', 'rails.png', 'bQCRs90wLgiy5KzuDQOa', '2010-10-22 21:07:10', 1, 'yyy9999', 'Female', 0, NULL, 'eNESAkHoSDKv59Jh6gGK', NULL, 'Doe', 'f53e4a8ac502c04852bfa4755ef60dd2c6e70c84e487b90e92836864107d5ce86a1e0f546beb7a40e6861e5d38775d57b6c5aed16116463c75488a1967315562', 0, 'G', '1962-04-01', NULL, 'jd111', NULL, 'Jane', 'http://picasaweb.google.com/jd111', '2009-01-01', 1)
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save

SELECT * FROM `users` WHERE (`users`.`id` = '1') LIMIT 1
UPDATE `users` SET `updated_at` = '2010-10-22 20:30:30', `perishable_token` = 'ofVWveOEM6bvtmGI79jU', `profile` = '.... member profile ... blah blah blah ...' WHERE `id` = 1
---
  def update
    @user = User.find(params[:id])
    #raise @user.inspect
    respond_to do |format|
      if @user.update_attributes(params[:user])

SELECT * FROM `users` WHERE (`users`.`id` = '1') LIMIT 1
SELECT * FROM `contacts` WHERE (`contacts`.user_id = 1)
SELECT * FROM `users`
DELETE FROM `users` WHERE `id` = 2
---
  def destroy
    @user = User.find(params[:id])

    if @user.contacts.present?
      @user.contacts.destroy

SELECT * FROM `users`
---
  def load_users
    @users = User.all