app/controllers/common/clubs_controller.rb

SELECT * FROM `clubs`
---
  def index
    @clubs = Club.all