app/controllers/common/legals_controller.rb

SELECT * FROM `clubs`
---
  def index
    @clubs = Club.all