app/controllers/common/privacies_controller.rb

  def index
    @clubs = Club.all
---
SELECT * FROM `clubs`