app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO `users` (`single_access_token`, `last_request_at`, `created_at`, `profile`, `crypted_password`, `user_image_url`, `perishable_token`, `updated_at`, `performance_team_member`, `usac_license`, `gender`, `failed_login_count`, `current_login_ip`, `password_salt`, `current_login_at`, `last_name`, `persistence_token`, `login_count`, `middle_initial`, `date_of_birth`, `last_login_ip`, `login`, `last_login_at`, `first_name`, `image_gallery_url`, `member_since`, `active`) VALUES('RxlhHFT3T0zNSBZgs4lG', '2010-10-17 23:11:27', '2010-10-17 23:11:27', 'member profile', 'f06bd2b8b525ef27543c2df23c3dc3f7a9b34be3aa61c2c5fa322e9172af92f26469dd996a6c9f7175a86f29b824f7af0402d842f36e327a9f763fe98dbf0326', 'rails.png', '5d0djCRkrKqKiDWe9GLI', '2010-10-17 23:11:27', 0, '', 'Male', 0, '127.0.0.1', 'UyUfwmlsAgRU7euFOpHY', '2010-10-17 23:11:27', 'Kutya', '0d9e98297c4fed929a4818b02ecab0276a31d046e2e5c8223b35c71857afecb3ce20100ba6aa8933c6992f989783d8a3402568952659eb34ed0c26686aaf66e8', 1, 'M', '1900-01-01', NULL, 'mkutya', NULL, 'Morzsa', '', '2005-01-19', 1)

  def edit
    @user = @current_user

    if @user.contacts.present?
---
SELECT * FROM `contacts` WHERE (`contacts`.user_id = 3)

  def update
    @user = @current_user

    if @user.update_attributes(params[:user])
---
UPDATE `users` SET `updated_at` = '2010-10-21 17:41:10', `perishable_token` = 'wx7egsBkjv8B9vFHjUhi', `profile` = 'I am contacting you about an opportunity that I have available as a Research and Development Engineer within the laboratory and applied science industry located in State College, Pennsylvania. Today, my client as a university center of excellence in naval science and technologies, with preeminence in undersea missions and related areas, provides solutions to problems in national security, economic competitiveness, and quality of life. In fulfillment of this mission the Laboratory: Performs basic and applied research, exploratory development, advanced development, and manufacturing technology in support of the Navy technology base. ' WHERE `id` = 1